In [1]:
# Operating system: MacOS 13.0
import pandas as pd
import numpy as np

In [2]:
import csv

with open('travel_data.csv', newline='') as csvfile:
    data = list(csv.reader(csvfile, delimiter='|'))

print(data)

[['travel_description', 'travel_date', 'section_order', 'city_from', 'city_to', 'section_distance_km', 'section_time_min', 'section_avg_speed_km_h', 'travel_avg_speed_km_h', 'travel_total_distance_km', 'driver_name', 'other_passengers'], ['Podróż z Poznania do Warszawy przez Łódź', '01/12/2020', '1', 'Poznań', 'Łódź', '218', '146', '89.59', '83.1', '349', 'Piotr Żyła', 'Krzysztof Ibisz,Edyta Górniak'], ['Podróż z Poznania do Warszawy przez Łódź', '01/12/2020', '2', 'Łódź', 'Warszawa', '131', '106', '74.15', '83.1', '349', 'Piotr Żyła', 'Krzysztof Ibisz'], ['Podróż z Wrocławia do Rzeszowa z przystankami', '12/12/2020', '1', 'Wrocław', 'Katowice', '195', '130', '90', '87.92', '444', 'Adam Nowak', 'Anna Kowalska,Jarosław Jakimowicz'], ['Podróż z Wrocławia do Rzeszowa z przystankami', '12/12/2020', '2', 'Katowice', 'Kraków', '79', '64', '74.06', '87.92', '444', 'Adam Nowak', 'Anna Kowalska,Jarosław Jakimowicz,Edyta Górniak'], ['Podróż z Wrocławia do Rzeszowa z przystankami', '12/12/2020', '3', 'Kraków', 'Rzeszów', '170', '109', '93.58', '87.92', '444', 'Adam Nowak', 'Edyta Górniak'], ['Podróż z Warszawy do Katowic - stajemy też w Łodzi', '08/12/2020', '1', 'Warszawa', 'Łódź', '131', '92', '85.43', '76.7', '418', 'Edyta Górniak', 'Jarosław Jakimowicz,Adam Nowak'], ['Podróż z Warszawy do Katowic - stajemy też w Łodzi', '08/12/2020', '2', 'Łódź', 'Katowice', '287', '235', '73.28', '76.7', '418', 'Edyta Górniak', 'Jarosław Jakimowicz']]

In [3]:
data_columns = data[0]

In [4]:
data_columns

['travel_description',
 'travel_date',
 'section_order',
 'city_from',
 'city_to',
 'section_distance_km',
 'section_time_min',
 'section_avg_speed_km_h',
 'travel_avg_speed_km_h',
 'travel_total_distance_km',
 'driver_name',
 'other_passengers']

In [5]:
data_content = data[1:]

# Main data frame

In [6]:
df = pd.DataFrame(data_content, columns = data_columns)

df

,travel_description,travel_date,section_order,city_from,city_to,section_distance_km,section_time_min,section_avg_speed_km_h,travel_avg_speed_km_h,travel_total_distance_km,driver_name,other_passengers
0,Podróż z Poznania do Warszawy przez Łódź,01/12/2020,1,Poznań,Łódź,218,146,89.59,83.1,349,Piotr Żyła,"Krzysztof Ibisz,Edyta Górniak"
1,Podróż z Poznania do Warszawy przez Łódź,01/12/2020,2,Łódź,Warszawa,131,106,74.15,83.1,349,Piotr Żyła,Krzysztof Ibisz
2,Podróż z Wrocławia do Rzeszowa z przystankami,12/12/2020,1,Wrocław,Katowice,195,130,90,87.92,444,Adam Nowak,"Anna Kowalska,Jarosław Jakimowicz"
3,Podróż z Wrocławia do Rzeszowa z przystankami,12/12/2020,2,Katowice,Kraków,79,64,74.06,87.92,444,Adam Nowak,"Anna Kowalska,Jarosław Jakimowicz,Edyta Górniak"
4,Podróż z Wrocławia do Rzeszowa z przystankami,12/12/2020,3,Kraków,Rzeszów,170,109,93.58,87.92,444,Adam Nowak,Edyta Górniak
5,Podróż z Warszawy do Katowic - stajemy też w Ł...,08/12/2020,1,Warszawa,Łódź,131,92,85.43,76.7,418,Edyta Górniak,"Jarosław Jakimowicz,Adam Nowak"
6,Podróż z Warszawy do Katowic - stajemy też w Ł...,08/12/2020,2,Łódź,Katowice,287,235,73.28,76.7,418,Edyta Górniak,Jarosław Jakimowicz

In [7]:
# Entities: Travels, Cities, Drivers, Passengers, Sections(?)

# Travels data frame

In [8]:
travels_df = df.loc[:, ["travel_description", "travel_date", "travel_avg_speed_km_h", "travel_total_distance_km"]]

travels_df = travels_df.drop_duplicates()
travels_df

,travel_description,travel_date,travel_avg_speed_km_h,travel_total_distance_km
0,Podróż z Poznania do Warszawy przez Łódź,01/12/2020,83.1,349
2,Podróż z Wrocławia do Rzeszowa z przystankami,12/12/2020,87.92,444
5,Podróż z Warszawy do Katowic - stajemy też w Ł...,08/12/2020,76.7,418

# Cities data frame

In [9]:
c_df = df[["city_from", "city_to"]]
c_df

  city_from   city_to
0    Poznań      Łódź
1      Łódź  Warszawa
2   Wrocław  Katowice
3  Katowice    Kraków
4    Kraków   Rzeszów
5  Warszawa      Łódź
6      Łódź  Katowice

In [10]:
cities_melted_df = pd.melt(c_df)

In [11]:
cities_melted_df

     variable     value
0   city_from    Poznań
1   city_from      Łódź
2   city_from   Wrocław
3   city_from  Katowice
4   city_from    Kraków
5   city_from  Warszawa
6   city_from      Łódź
7     city_to      Łódź
8     city_to  Warszawa
9     city_to  Katowice
10    city_to    Kraków
11    city_to   Rzeszów
12    city_to      Łódź
13    city_to  Katowice

In [12]:
cities_array = cities_melted_df["value"].unique()

In [13]:
cities_df_unique = pd.DataFrame(data = cities_array)

In [14]:
cities_df_unique

          0
0    Poznań
1      Łódź
2   Wrocław
3  Katowice
4    Kraków
5  Warszawa
6   Rzeszów

In [15]:
cities_df = cities_df_unique.rename({0: "city_name"}, axis='columns')

In [16]:
cities_df

  city_name
0    Poznań
1      Łódź
2   Wrocław
3  Katowice
4    Kraków
5  Warszawa
6   Rzeszów

# Sections data frame

In [17]:
sections_df = df.loc[:, ["travel_description", "section_order", "city_from", "city_to", "section_distance_km", "section_time_min", "section_avg_speed_km_h"]]
#sections_df["section_id"] = df.index + 1


#cols = list(sections_df.columns)
#cols = [cols[-1]] + cols[:-1]
#sections_df = sections_df[cols]

In [18]:
sections_df

,travel_description,section_order,city_from,city_to,section_distance_km,section_time_min,section_avg_speed_km_h
0,Podróż z Poznania do Warszawy przez Łódź,1,Poznań,Łódź,218,146,89.59
1,Podróż z Poznania do Warszawy przez Łódź,2,Łódź,Warszawa,131,106,74.15
2,Podróż z Wrocławia do Rzeszowa z przystankami,1,Wrocław,Katowice,195,130,90
3,Podróż z Wrocławia do Rzeszowa z przystankami,2,Katowice,Kraków,79,64,74.06
4,Podróż z Wrocławia do Rzeszowa z przystankami,3,Kraków,Rzeszów,170,109,93.58
5,Podróż z Warszawy do Katowic - stajemy też w Ł...,1,Warszawa,Łódź,131,92,85.43
6,Podróż z Warszawy do Katowic - stajemy też w Ł...,2,Łódź,Katowice,287,235,73.28

# Drivers data frame

In [19]:
ddr_df = df[["travel_description", "section_order", "driver_name", "other_passengers"]]
# "travel_description"

In [20]:
ddr_df

,travel_description,section_order,driver_name,other_passengers
0,Podróż z Poznania do Warszawy przez Łódź,1,Piotr Żyła,"Krzysztof Ibisz,Edyta Górniak"
1,Podróż z Poznania do Warszawy przez Łódź,2,Piotr Żyła,Krzysztof Ibisz
2,Podróż z Wrocławia do Rzeszowa z przystankami,1,Adam Nowak,"Anna Kowalska,Jarosław Jakimowicz"
3,Podróż z Wrocławia do Rzeszowa z przystankami,2,Adam Nowak,"Anna Kowalska,Jarosław Jakimowicz,Edyta Górniak"
4,Podróż z Wrocławia do Rzeszowa z przystankami,3,Adam Nowak,Edyta Górniak
5,Podróż z Warszawy do Katowic - stajemy też w Ł...,1,Edyta Górniak,"Jarosław Jakimowicz,Adam Nowak"
6,Podróż z Warszawy do Katowic - stajemy też w Ł...,2,Edyta Górniak,Jarosław Jakimowicz

In [21]:
people_df_dup = (
    ddr_df.assign(other_passengers=ddr_df.other_passengers.str.split(','))
    .explode('other_passengers')
)

In [22]:
people_df_dup

,travel_description,section_order,driver_name,other_passengers
0,Podróż z Poznania do Warszawy przez Łódź,1,Piotr Żyła,Krzysztof Ibisz
0,Podróż z Poznania do Warszawy przez Łódź,1,Piotr Żyła,Edyta Górniak
1,Podróż z Poznania do Warszawy przez Łódź,2,Piotr Żyła,Krzysztof Ibisz
2,Podróż z Wrocławia do Rzeszowa z przystankami,1,Adam Nowak,Anna Kowalska
2,Podróż z Wrocławia do Rzeszowa z przystankami,1,Adam Nowak,Jarosław Jakimowicz
3,Podróż z Wrocławia do Rzeszowa z przystankami,2,Adam Nowak,Anna Kowalska
3,Podróż z Wrocławia do Rzeszowa z przystankami,2,Adam Nowak,Jarosław Jakimowicz
3,Podróż z Wrocławia do Rzeszowa z przystankami,2,Adam Nowak,Edyta Górniak
4,Podróż z Wrocławia do Rzeszowa z przystankami,3,Adam Nowak,Edyta Górniak
5,Podróż z Warszawy do Katowic - stajemy też w Ł...,1,Edyta Górniak,Jarosław Jakimowicz
5,Podróż z Warszawy do Katowic - stajemy też w Ł...,1,Edyta Górniak,Adam Nowak
6,Podróż z Warszawy do Katowic - stajemy też w Ł...,2,Edyta Górniak,Jarosław Jakimowicz

In [23]:
#people_melted_df = pd.melt(people_df_dup)

In [24]:
#people_melted_df.drop_duplicates()

In [25]:
drivers_df = people_df_dup[["travel_description", "driver_name"]].drop_duplicates()

In [26]:
drivers_df

                                  travel_description    driver_name
0           Podróż z Poznania do Warszawy przez Łódź     Piotr Żyła
2      Podróż z Wrocławia do Rzeszowa z przystankami     Adam Nowak
5  Podróż z Warszawy do Katowic - stajemy też w Ł...  Edyta Górniak

In [27]:
passengers_sections_sliced = people_df_dup[["travel_description", "section_order", "other_passengers"]]

In [28]:
passengers_sections_df = passengers_sections_sliced.rename({"other_passengers": "passenger_name"}, axis='columns')

In [29]:
passengers_sections_df

,travel_description,section_order,passenger_name
0,Podróż z Poznania do Warszawy przez Łódź,1,Krzysztof Ibisz
0,Podróż z Poznania do Warszawy przez Łódź,1,Edyta Górniak
1,Podróż z Poznania do Warszawy przez Łódź,2,Krzysztof Ibisz
2,Podróż z Wrocławia do Rzeszowa z przystankami,1,Anna Kowalska
2,Podróż z Wrocławia do Rzeszowa z przystankami,1,Jarosław Jakimowicz
3,Podróż z Wrocławia do Rzeszowa z przystankami,2,Anna Kowalska
3,Podróż z Wrocławia do Rzeszowa z przystankami,2,Jarosław Jakimowicz
3,Podróż z Wrocławia do Rzeszowa z przystankami,2,Edyta Górniak
4,Podróż z Wrocławia do Rzeszowa z przystankami,3,Edyta Górniak
5,Podróż z Warszawy do Katowic - stajemy też w Ł...,1,Jarosław Jakimowicz
5,Podróż z Warszawy do Katowic - stajemy też w Ł...,1,Adam Nowak
6,Podróż z Warszawy do Katowic - stajemy też w Ł...,2,Jarosław Jakimowicz

In [30]:
passengers_df = passengers_sections_df[["passenger_name"]].drop_duplicates()

In [31]:
passengers_df

        passenger_name
0      Krzysztof Ibisz
0        Edyta Górniak
2        Anna Kowalska
2  Jarosław Jakimowicz
5           Adam Nowak

# Schemas:

In [89]:
travels_schema = """
travel_description VARCHAR PRIMARY KEY NOT NULL,
travel_date DATE,
travel_avg_speed_km_h FLOAT,
travel_total_distance_km FLOAT
"""

cities_schema = """
city_name VARCHAR PRIMARY KEY NOT NULL,
row_timestamp TIMESTAMP NOT NULL
"""

sections_schema = """
travel_description VARCHAR REFERENCES travels(travel_description),
section_order INT NOT NULL,
city_from VARCHAR REFERENCES cities(city_name),
city_to VARCHAR REFERENCES cities(city_name),
section_distance_km INT,
section_time_min INT,
section_avg_speed_km_h FLOAT,
PRIMARY KEY(travel_description, section_order)
"""

drivers_schema = """
driver_name VARCHAR PRIMARY KEY NOT NULL,
travel_description VARCHAR REFERENCES travels(travel_description)
"""

passengers_schema = """
passenger_name VARCHAR PRIMARY KEY NOT NULL,
row_timestamp TIMESTAMP NOT NULL
"""

passengers_sections_schema = """
travel_description VARCHAR NOT NULL,
section_order INT NOT NULL,
FOREIGN KEY (travel_description, section_order) REFERENCES sections(travel_description, section_order),
passenger_name VARCHAR REFERENCES passengers(passenger_name),
PRIMARY KEY (travel_description, section_order, passenger_name)
"""

# SQL methods

In [33]:
import psycopg2
import os
from datetime import datetime

In [34]:
def run_syntax(db_connection: psycopg2, syntax: str) -> None:
    """
    Run syntax.
    :param db_connection: Database connection object.
    :param syntax: Syntax for execution.
    """
    cur = db_connection.cursor()
    cur.execute(syntax)
    cur.close()

In [35]:
def create_table(schema: str, table: str) -> None:
    """
    Create a table in the DB based on a schema.
    :param schema: The table schema.
    :param schema: The schema.
    :param table: The name of the table.
    """
    db_connection = psycopg2.connect(
        host="ec2-52-31-70-136.eu-west-1.compute.amazonaws.com",
        user="fodrsjfllnljnm",
        password="60fb3f606b8de4e7d39a8efb6d48931a7123418d5fcfb0e27d74957ded438c25",
        dbname="dbphbgo6dthk7q",
    )

    # Create table if it does not yet exist
    run_syntax(db_connection=db_connection, syntax=f"CREATE TABLE IF NOT EXISTS {table}({schema})")

    db_connection.commit()
    db_connection.close()

In [36]:
def populate_table(table_name: str, df: pd.DataFrame) -> None:
    """
    Populate a table in the database from a pandas dataframe.
    :param table_name: The name of the table in the DB that we will add the values in df to.
    :param df: The dataframe that we use for puplating the table.
    """
    db_connection = psycopg2.connect(
        host="ec2-52-31-70-136.eu-west-1.compute.amazonaws.com",
        user="fodrsjfllnljnm",
        password="60fb3f606b8de4e7d39a8efb6d48931a7123418d5fcfb0e27d74957ded438c25",
        dbname="dbphbgo6dthk7q",
    )

    # Check that all columns are present in the CSV file
    cur = db_connection.cursor()
    cur.execute(f"SELECT * FROM {table_name} LIMIT 0")
    cur.close()

    col_names = [i[0] for i in cur.description]
    df["row_timestamp"] = [datetime.now().strftime("%m-%d-%Y %H:%M:%S")] * len(df.index)

    missing_columns = set(col_names).difference(df.columns)
    assert not missing_columns, f"The following columns are missing in your CSV file: {','.join(missing_columns)}"

    # Re-order CSV
    df = df[col_names]

    # Inject data
    for index, row in df.iterrows():
        run_syntax(db_connection=db_connection, syntax=f"INSERT INTO {table_name} VALUES{tuple(row.values)}")
    db_connection.commit()
    db_connection.close()

In [37]:
def drop_table(table_name: str) -> None:
    """
    Populate a table in the database from a pandas dataframe.
    :param table_name: The name of the table in the DB that we will add the values in df to.
    :param df: The dataframe that we use for puplating the table.
    """
    db_connection = psycopg2.connect(
        host="ec2-52-31-70-136.eu-west-1.compute.amazonaws.com",
        user="fodrsjfllnljnm",
        password="60fb3f606b8de4e7d39a8efb6d48931a7123418d5fcfb0e27d74957ded438c25",
        dbname="dbphbgo6dthk7q",
    )
    
    cur = db_connection.cursor()
    cur.execute(f"DROP TABLE {table_name}")
    cur.close()
    
    db_connection.commit()
    db_connection.close()

# Creating & populating the first table

In [32]:
create_table(table="Travels", schema=travels_schema)

In [33]:
populate_table(table_name="Travels", df=travels_df)

In [31]:
drop_table(table_name = "Travels")

# Creating table Cities

In [50]:
create_table(table="Cities", schema=cities_schema)

In [51]:
populate_table(table_name="Cities", df=cities_df)

In [49]:
drop_table(table_name = "Cities")

In [52]:
cities_df

  city_name        row_timestamp
0    Poznań  10-31-2022 18:14:14
1      Łódź  10-31-2022 18:14:14
2   Wrocław  10-31-2022 18:14:14
3  Katowice  10-31-2022 18:14:14
4    Kraków  10-31-2022 18:14:14
5  Warszawa  10-31-2022 18:14:14
6   Rzeszów  10-31-2022 18:14:14

# Creating table Sections

In [91]:
create_table(table="Sections", schema=sections_schema)

In [92]:
populate_table(table_name="Sections", df=sections_df)

In [90]:
drop_table(table_name = "Sections")

# Creating Drivers table

In [34]:
create_table(table="Drivers", schema=drivers_schema)

In [35]:
populate_table(table_name="Drivers", df=drivers_df)

In [33]:
drop_table(table_name = "Drivers")

# Creating Passengers table

In [97]:
create_table(table="Passengers", schema=passengers_schema)

In [58]:
populate_table(table_name="Passengers", df=passengers_df)

In [56]:
drop_table(table_name = "Passengers")

# Creating Passengers-Trips table

In [93]:
create_table(table="PassengersSections", schema=passengers_sections_schema)

In [94]:
populate_table(table_name="PassengersSections", df=passengers_sections_df)

In [92]:
drop_table(table_name = "PassengersSections")